/**
  ******************************************************************************
  * @文件名     ： canopen_app.h
  * @作者       ： strongerHuang
  * @版本       ： V1.0.0
  * @日期       ： 2018年11月14日
  * @摘要       ： 应用程序头文件
  ******************************************************************************/

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef _CANOPEN_APP_H
#define _CANOPEN_APP_H

/* 包含的头文件 --------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"


/* 宏定义 --------------------------------------------------------------------*/
#define CANOPEN_STACK_SIZE        2048                      //CANOPEN任务堆栈大小
#define CANOPEN_TASK_PRIORITY     2                        //CANOPEN任务优先级


/* 函数申明 ------------------------------------------------------------------*/
void CANOpen_App_Init(void);


#endif /* _CANOPEN_APP_H */

/**** Copyright (C)2018 strongerHuang. All Rights Reserved **** END OF FILE ****/
